testCaseSphereSmoothing/symmetry/sphere/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable false;

functions
{
    inlet
    {
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    writeControl    writeTime;
    log             yes;
    regionType      patch;
    name	        minX;
    writeFields     false;
    writeArea	    true;
    operation       areaIntegrate;
    fields
    (
        p
    );
    }
    outlet
    {
    type            surfaceFieldValue;
    libs            (fieldFunctionObjects);
    writeControl    writeTime;
    log             yes;
    regionType      patch;
    name	        maxX;
    writeFields     false;
    writeArea	    true;
    operation       areaIntegrate;
    fields
    (
        U
    );
    }

}


// ************************************************************************* //
