testCaseSphereSmoothing/symmetry/sphere/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0001 0 0);

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform (0.0001 0 0);
    }
    maxX
    {
        type            zeroGradient;
    }
    minY
    {
        type            symmetryPlane;
    }
    maxY
    {
        type            symmetryPlane;
    }
    minZ
    {
        type            symmetryPlane;
    }
    maxZ
    {
        type            symmetryPlane;
    }
    PorousMedia
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}
// ************************************************************************* //
